# misc/Brewfile

# (1) Repositories -------------------------------- {{{1

tap 'github/gh'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'shivammathur/php'
tap 'universal-ctags/universal-ctags'



# (2) Formulae ------------------------------------ {{{1

brew 'zsh'
brew 'tmux'
brew 'fzf'

brew 'curl'
brew 'wget'
brew 'rsync'
brew 'lftp'
brew 'httpie'
brew 'jq'

brew 'git'
brew 'git-delta'
brew 'git-flow-avh'
brew 'gh'

brew 'ack'
brew 'tree'
brew 'bat'
brew 'fd'
brew 'ripgrep'

brew 'neovim'
brew 'shellcheck'
brew 'yamllint'
brew 'tidy-html5', args: ['HEAD']
brew 'universal-ctags', args: ['HEAD']

brew 'php'
brew 'composer'
brew 'pyenv'

brew 'tag'
brew 'trash'
brew 'terminal-notifier'



# (3) Applications -------------------------------- {{{1

cask 'appcleaner'

cask 'arc'
cask 'firefox'
cask 'google-chrome'

cask 'visual-studio-code'
cask 'dash'
cask 'tableplus'

cask 'font-charter'
cask 'font-fira-sans'
cask 'font-fira-code'
cask 'font-ibm-plex'



# vim:foldmethod=marker:foldlevel=2
