akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alefragnani.project-manager
bierner.lit-html
bmewburn.vscode-intelephense-client
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
csstools.postcss
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dbankier.vscode-quick-select
deerawan.vscode-dash
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
esbenp.prettier-vscode
getpsalm.psalm-vscode-plugin
Gruntfuggly.todo-tree
jock.svg
junstyle.php-cs-fixer
mikestead.dotenv
mrmlnc.vscode-apache
onecentlin.laravel-blade
ritwickdey.LiveServer
ronnidc.nunjucks
stkb.rewrap
stylelint.vscode-stylelint
whatwedo.twig
wwm.better-align
xdebug.php-debug
zignd.html-css-class-completion
