akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alefragnani.project-manager
ban.spellright
bierner.lit-html
calebporzio.better-phpunit
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
csstools.postcss
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dbankier.vscode-quick-select
deerawan.vscode-dash
eamodio.gitlens
ecmel.vscode-html-css
ecodes.vscode-phpmd
EditorConfig.EditorConfig
eg2.vscode-npm-script
felixfbecker.php-debug
felixfbecker.php-intellisense
firefox-devtools.vscode-firefox-debug
ikappas.phpcs
jock.svg
junstyle.php-cs-fixer
mikestead.dotenv
mrmlnc.vscode-apache
ms-azuretools.vscode-docker
msjsdiag.debugger-for-chrome
neilbrayfield.php-docblocker
Orta.vscode-jest
ronnidc.nunjucks
shinnn.stylelint
stkb.rewrap
vincaslt.highlight-matching-tag
WallabyJs.quokka-vscode
whatwedo.twig
wwm.better-align
