# misc/Brewfile

# (1) Repositories -------------------------------- {{{1

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'universal-ctags/universal-ctags'



# (2) Formulae ------------------------------------ {{{1

brew 'bash'
brew 'bash-completion@2'
brew 'tmux'
brew 'fzf'

brew 'curl'
brew 'wget'
brew 'rsync'
brew 'httpie'
brew 'jq'

brew 'git'
brew 'icdiff'
brew 'diff-so-fancy'

brew 'ack'
brew 'tree'
brew 'bat'
brew 'ripgrep'

brew 'neovim'
brew 'shellcheck'
brew 'yamllint'
brew 'tidy-html5', args: ['HEAD']
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']

brew 'composer'

brew 'mas'
brew 'tag'
brew 'trash'
brew 'terminal-notifier'



# (3) Applications -------------------------------- {{{1

cask_args appdir: '~/Applications'

cask '1password'
cask 'alfred'
cask 'bartender'
cask 'itsycal'
cask 'daisydisk'
cask 'the-unarchiver'

cask 'firefox'
cask 'google-chrome'

cask 'spotify'

cask 'imagealpha'
cask 'imageoptim'
cask 'contraste'

cask 'visual-studio-code'
cask 'dash'
cask 'tad'

cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'

cask 'font-fira-code'
cask 'font-source-code-pro'

mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'Amphetamine', id: 937984704
mas 'Gestimer', id: 990588172
mas 'Magnet', id: 441258766
mas 'Things3', id: 904280696



# vim:foldmethod=marker:foldlevel=2
